DiffusiveMixing/Resolution_80/Case4/system/blockMeshDict
FoamFile
{
	format      ascii;
	class       dictionary;
	object      blockMeshDict;
}

convertToMeters 1;

vertices (
	(-0.0000223606797749979 0.0000447213595499958 0)
	(0.0000223606797749979 -0.0000447213595499958 0)
	(0.0020000000000000005 0.0009440983005625054 0)
	(0.0018881966011250109 0.0009999999999999998 0)
	(0.0000223606797749979 0.002044721359549996 0)
	(-0.0000223606797749979 0.001955278640450004 0)
	(0.0019901273475458935 0.0010608380256645483 0)
	(0.0020844082517040997 0.001013697573585445 0)
	(0.004020710678118655 0.0029500000000000004 0)
	(0.003929289321881345 0.003 0)
	(-0.0000223606797749979 0.004044721359549996 0)
	(0.0000223606797749979 0.003955278640450004 0)
	(0.001990127347545893 0.004939161974335452 0)
	(0.0018881966011250109 0.005 0)
	(0.0000223606797749979 0.006044721359549996 0)
	(-0.0000223606797749979 0.005955278640450004 0)
	(0.002 0.005055901699437495 0)
	(0.0020844082517040997 0.004986302426414555 0)
	(0.004 0.003070710678118655 0)
	(0.004120710678118655 0.00305 0)
	(0.00595 0.00295 0)
	(0.00595 0.00305 0)
	(0.00605 0.0029500000000000004 0)
	(0.00595 0.001 0)
	(0.00605 0.001 0)
	(0.00605 0.00305 0)
	(0.00605 0.005 0)
	(0.00595 0.005 0)
	(0.00798819660112501 0.00295 0)
	(0.00798819660112501 0.00305 0)
	(0.008211803398874989 0.00295 0)
	(0.009977639320225003 0.001955278640450004 0)
	(0.010022360679774998 0.002044721359549996 0)
	(0.008211803398874989 0.00305 0)
	(0.01 0.00295 0)
	(0.01 0.00305 0)
	(0.010022360679774998 0.003955278640450004 0)
	(0.009977639320225003 0.004044721359549996 0)
	(-0.0000223606797749979 0.0000447213595499958 0.0001)
	(0.0000223606797749979 -0.0000447213595499958 0.0001)
	(0.0020000000000000005 0.0009440983005625054 0.0001)
	(0.0018881966011250109 0.0009999999999999998 0.0001)
	(0.0000223606797749979 0.002044721359549996 0.0001)
	(-0.0000223606797749979 0.001955278640450004 0.0001)
	(0.0019901273475458935 0.0010608380256645483 0.0001)
	(0.0020844082517040997 0.001013697573585445 0.0001)
	(0.004020710678118655 0.0029500000000000004 0.0001)
	(0.003929289321881345 0.003 0.0001)
	(-0.0000223606797749979 0.004044721359549996 0.0001)
	(0.0000223606797749979 0.003955278640450004 0.0001)
	(0.001990127347545893 0.004939161974335452 0.0001)
	(0.0018881966011250109 0.005 0.0001)
	(0.0000223606797749979 0.006044721359549996 0.0001)
	(-0.0000223606797749979 0.005955278640450004 0.0001)
	(0.002 0.005055901699437495 0.0001)
	(0.0020844082517040997 0.004986302426414555 0.0001)
	(0.004 0.003070710678118655 0.0001)
	(0.004120710678118655 0.00305 0.0001)
	(0.00595 0.00295 0.0001)
	(0.00595 0.00305 0.0001)
	(0.00605 0.0029500000000000004 0.0001)
	(0.00595 0.001 0.0001)
	(0.00605 0.001 0.0001)
	(0.00605 0.00305 0.0001)
	(0.00605 0.005 0.0001)
	(0.00595 0.005 0.0001)
	(0.00798819660112501 0.00295 0.0001)
	(0.00798819660112501 0.00305 0.0001)
	(0.008211803398874989 0.00295 0.0001)
	(0.009977639320225003 0.001955278640450004 0.0001)
	(0.010022360679774998 0.002044721359549996 0.0001)
	(0.008211803398874989 0.00305 0.0001)
	(0.01 0.00295 0.0001)
	(0.01 0.00305 0.0001)
	(0.010022360679774998 0.003955278640450004 0.0001)
	(0.009977639320225003 0.004044721359549996 0.0001)
);

blocks (
	hex (0 1 2 3 38 39 40 41) (80 896 1) simpleGrading (1 1 1)
	hex (4 5 3 6 42 43 41 44) (80 896 1) simpleGrading (1 1 1)
	hex (6 7 8 9 44 45 46 47) (80 1132 1) simpleGrading (1 1 1)
	hex (10 11 12 13 48 49 50 51) (80 896 1) simpleGrading (1 1 1)
	hex (14 15 13 16 52 53 51 54) (80 896 1) simpleGrading (1 1 1)
	hex (17 12 9 18 55 50 47 56) (80 1132 1) simpleGrading (1 1 1)
	hex (19 8 20 21 57 46 58 59) (80 800 1) simpleGrading (1 1 1)
	hex (22 20 23 24 60 58 61 62) (80 800 1) simpleGrading (1 1 1)
	hex (21 25 26 27 59 63 64 65) (80 800 1) simpleGrading (1 1 1)
	hex (25 22 28 29 63 60 66 67) (80 800 1) simpleGrading (1 1 1)
	hex (30 28 31 32 68 66 69 70) (80 896 1) simpleGrading (1 1 1)
	hex (33 30 34 35 71 68 72 73) (80 800 1) simpleGrading (1 1 1)
	hex (29 33 36 37 67 71 74 75) (80 896 1) simpleGrading (1 1 1)
	hex (6 3 2 7 44 41 40 45) (80 80 1) simpleGrading (1 1 1)
	hex (13 12 17 16 51 50 55 54) (80 80 1) simpleGrading (1 1 1)
	hex (9 8 19 18 47 46 57 56) (80 80 1) simpleGrading (1 1 1)
	hex (22 25 21 20 60 63 59 58) (80 80 1) simpleGrading (1 1 1)
	hex (30 33 29 28 68 71 67 66) (80 80 1) simpleGrading (1 1 1)
);

edges (
);

boundary (
	walls {
		type wall;
		faces (
			(1 2 39 40)
			(3 0 41 38)
			(5 3 43 41)
			(6 4 44 42)
			(7 8 45 46)
			(9 6 47 44)
			(11 12 49 50)
			(13 10 51 48)
			(15 13 53 51)
			(16 14 54 52)
			(12 9 50 47)
			(18 17 56 55)
			(8 20 46 58)
			(21 19 59 57)
			(20 23 58 61)
			(24 22 62 60)
			(25 26 63 64)
			(27 21 65 59)
			(22 28 60 66)
			(29 25 67 63)
			(28 31 66 69)
			(32 30 70 68)
			(30 34 68 72)
			(35 33 73 71)
			(33 36 71 74)
			(37 29 75 67)
			(2 7 40 45)
			(17 16 55 54)
			(19 18 57 56)
		);
	}
	inlet_0 {
		type patch;
		faces (
			(0 1 38 39)
		);
	}
	inlet_1 {
		type patch;
		faces (
			(4 5 42 43)
		);
	}
	inlet_2 {
		type patch;
		faces (
			(10 11 48 49)
		);
	}
	inlet_3 {
		type patch;
		faces (
			(14 15 52 53)
		);
	}
	inlet_4 {
		type patch;
		faces (
			(31 32 69 70)
		);
	}
	inlet_5 {
		type patch;
		faces (
			(34 35 72 73)
		);
	}
	inlet_6 {
		type patch;
		faces (
			(36 37 74 75)
		);
	}
	outlet_0 {
		type patch;
		faces (
			(23 24 61 62)
		);
	}
	outlet_1 {
		type patch;
		faces (
			(26 27 64 65)
		);
	}
);